;   ----------------------------------------------------------------------
;                        Пример шаблона для GoldED
;   ----------------------------------------------------------------------
;
@LoadLanguage goldlang.cfg
;  
;   ----------------------------------------------------------------------
;  Эти строки вставляются в качестве заголовка сохраняемого сообщения.
;   ----------------------------------------------------------------------
@Header= @ODesc (@CAddr) @OEcho @Align{79}{=}
@Header Сооб : @Msgno из @Msgs@Align{44}@Attr
@Header От   : @_OName  @_OAddr @ODate @OTime
@Header Кому : @DName
@Header Тема : @Subject
@Header@Align{79}{=}
;
;   ----------------------------------------------------------------------
;   Эти строки будут вставляться при ответе в другую область
;   ----------------------------------------------------------------------
@Moved
@Moved*** Ответ на сообщение из @OEcho (@ODesc).
@Moved
;
;   ----------------------------------------------------------------------
;   Эти строки будут вставляться при изменении сообщения, автором которого
;   являетесь не Вы
;   ----------------------------------------------------------------------
@Changed
@Changed*** Изменено @CName (@CAddr), @CDate @CTime.
@Changed
;
;   ----------------------------------------------------------------------
;   Эти строки будут вставляться при форварде.
;   ----------------------------------------------------------------------
@Forward@Forcesubj[FWD] @subject
@Forward=============================================================================
@Forward* Переслал @CName (@CAddr)
@Forward* Обл. : @OEcho (@ODesc)
@Forward* От   : @OName, @OAddr (@ODate @OTime)
@Forward* Кому : @DName
@Forward* Линк : @OFGHIUrl
@Forward* Тема : @Subject
@Forward=============================================================================
;
;   ----------------------------------------------------------------------
;   При форварде, или при изменении сообщения, оригинальное сообщение будет
;   вставляться здесь, на месте "@Message".
;   ----------------------------------------------------------------------
@Message
;
@Forward=============================================================================
@Forward
;
;   ----------------------------------------------------------------------
;   Начало обычного шаблона.
;   ----------------------------------------------------------------------
Привет, @Pseudo!
;@echoXC: #@cecho, #CC.MY.ECHOMAIL
;@netXC: #@cecho, #CC.MY.NETMAIL
;
;   ----------------------------------------------------------------------
;   Вставка дополнительных пустых строк в новое сообщение (не в ответ).
;   ----------------------------------------------------------------------
@New
;
;   ----------------------------------------------------------------------
;   Позиция курсора в редакторе.
;   ----------------------------------------------------------------------
@Position
;
;   ----------------------------------------------------------------------
;   При ответе без цитирования, добавим эти строки.
;   ----------------------------------------------------------------------
@ReplyОтвет на письмо датированное <@ODate>, @OName -> @DName, в сообщении по ссылке @OFGHIUrl:
@Reply@Position
;
;   ----------------------------------------------------------------------
;   При ответе-комментарии, добавим эти строки.
;   ----------------------------------------------------------------------
@Comment@ODate @OTime, @OName -> @DName в сообщении по ссылке @OFGHIUrl:
@Comment@Position
;
;   ----------------------------------------------------------------------
;   При ответе с цитированием, добавим эти строки.
;   ----------------------------------------------------------------------
@Quoted@ODate @OTime, @OName -> @DName в сообщении по ссылке @OFGHIUrl:
@Quoted@Position
;
;   ----------------------------------------------------------------------
;   Для цитирования из файлового буфера, добавим эти строки.
;   ----------------------------------------------------------------------
@Quotebuf
@Quotebuf@ODate @OTime, @OName -> @DName:
@Quotebuf
;
;   ----------------------------------------------------------------------
;   Здесь будет вставлено оригинальное цитируемое сообщение
;   ----------------------------------------------------------------------
@Quote

;   ----------------------------------------------------------------------
;   Подпишемся своим именем.
;   ----------------------------------------------------------------------
С наилучшими пожеланиями, @CFName.

;   ----------------------------------------------------------------------
;   Конец шаблона.
;   ----------------------------------------------------------------------
